export const faqData = [
  {question: 'Как быстро осуществляется доставка заказов?', answer:'Мы отправляем заказы в течение 1 рабочего дня после оплаты. Доставка по России занимает от 2 до 5 дней, в страны СНГ — от 5 до 10 дней в зависимости от региона и выбранной службы доставки. Возможен самовывоз и экспресс-доставка в некоторых городах'},
  {question: 'Можно ли получить консультацию по подбору инструментов или расходников?', answer:'Подробную информацию об инструментах и материалах узнайте у нашего менеджера по телефону или в мессенджере.'},
  {question: 'Есть ли оптовые цены и скидки для клиник и постоянных клиентов?', answer:'Скидки предусмотрены при больших объемах заказа и для постоянных клиентов. Уточните детали у менеджера.'},
  {question: 'Какие документы предоставляются при покупке?', answer:'При покупки частным лицам будет предоставлен чек на продукцию . Юридическим лицам выдаются все накладные и прочие документы, связанные с покупкой. Детали уточняйте у менеджера.'},
]