const categorySubcategories = {
    "Врачам": [
        "Перчатки", 
        "Шприцы", 
        "Маски", 
        "Профессиональные инструменты", 
        "Антисептики"
    ],
    "Ученикам": [
        "Учебные модели", 
        "Фантомы", 
        "Базовые инструменты", 
        "Учебные пособия", 
        "Наборы для практики"
    ],
    "Зуботехникам": [
        "Зубопротезные материалы", 
        "Артикуляторы", 
        "Воски и восковки", 
        "Керамика", 
        "Полировочные материалы"
    ],
};

const subcategories = [
    "Все", 
    "Анестезия", 
    "Шовный материал", 
    "Гигиена и профилактика", 
    "Гигиена и профилактика", 
    "Гигиена и профилактика", 
    "Гигиена", 
    "Гигиена и профилактика", 
    "Гигиена и профилактика", 
    "Гигиена"
];

export { categorySubcategories, subcategories };