export const faqData = [
  {question: 'Как быстро осуществляется доставка заказов?', answer:'Мы отправляем заказы в течение 1 рабочего дня после оплаты. Доставка по России занимает от 2 до 5 дней, в страны СНГ — от 5 до 10 дней в зависимости от региона и выбранной службы доставки. Возможен самовывоз и экспресс-доставка в некоторых городах'},
  {question: 'Можно ли получить консультацию по подбору инструментов или расходников?', answer:''},
  {question: 'Есть ли оптовые цены и скидки для клиник и постоянных клиентов?', answer:''},
  {question: 'Какие документы предоставляются при покупке?', answer:''},
]